In [1]:
ls

 Volume in drive C is OS
 Volume Serial Number is BC71-E9D8

 Directory of C:\Users\Tushar Shah

15-07-2018  12:28    <DIR>          .
15-07-2018  12:28    <DIR>          ..
05-07-2018  23:17    <DIR>          .anaconda
07-07-2018  17:19               708 .bash_history
15-07-2018  12:28    <DIR>          .conda
15-07-2018  09:41                43 .condarc
07-07-2018  00:50                24 .gitconfig
15-07-2018  12:28    <DIR>          .ipynb_checkpoints
06-07-2018  22:20    <DIR>          .ipython
07-07-2018  14:03    <DIR>          .jupyter
06-07-2018  22:20    <DIR>          .matplotlib
08-07-2018  13:30    <DIR>          .PyCharmCE2018.1
15-07-2018  09:41    <DIR>          .spyder-py3
05-07-2018  23:09    <DIR>          .vscode
15-07-2018  00:02    <DIR>          3D Objects
15-07-2018  00:02    <DIR>          Contacts
15-07-2018  01:12    <DIR>          Desktop
15-07-2018  00:02    <DIR>          Documents
15-07-2018  01:04    <DIR>          Downloads
15-07-2018  01:07    <DIR>          Dropbox
15-07-2018  00:02    <DIR>          Favorites
15-07-2018  01:09    <DIR>          Google Drive
15-07-2018  00:02    <DIR>          Links
15-07-2018  00:02    <DIR>          Music
02-07-2018  23:12    <DIR>          OneDrive
15-07-2018  00:02    <DIR>          Pictures
02-07-2018  23:31    <DIR>          Roaming
15-07-2018  00:02    <DIR>          Saved Games
15-07-2018  00:02    <DIR>          Searches
08-07-2018  17:06            21,939 Untitled.ipynb
08-07-2018  14:47               734 Untitled1.ipynb
14-07-2018  17:18           112,297 Untitled2.ipynb
15-07-2018  12:27            66,526 Untitled3.ipynb
15-07-2018  12:28                72 Untitled4.ipynb
15-07-2018  11:30    <DIR>          Videos
               8 File(s)        202,343 bytes
              27 Dir(s)  47,728,529,408 bytes free

In [3]:
import os
os.chdir("D:\GreyAtom\Datasets")

In [5]:
names=["United States", "Australia", "Japan", "India", "Russia", "Morocco", "Egypt"]
dr = [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]
my_dict = {}

In [8]:
my_dict["countries"] = names
my_dict["drive_right"] = dr
my_dict["cars_per_capita"] = cpc

In [9]:
my_dict

{'countries': ['United States',
  'Australia',
  'Japan',
  'India',
  'Russia',
  'Morocco',
  'Egypt'],
 'drive_right': [True, False, False, False, True, True, True],
 'carspercapita': [809, 731, 588, 18, 200, 70, 45],
 'cars_per_capita': [809, 731, 588, 18, 200, 70, 45]}

In [12]:
import pandas as pd
cars = pd.DataFrame(my_dict)
cars

       countries  drive_right  carspercapita  cars_per_capita
0  United States         True            809              809
1      Australia        False            731              731
2          Japan        False            588              588
3          India        False             18               18
4         Russia         True            200              200
5        Morocco         True             70               70
6          Egypt         True             45               45

In [13]:
row_labels = ["USA", "AUS", "JAP", "IND", "RUS", "MOR", "ENG"]

In [14]:
cars.index = row_labels
cars

         countries  drive_right  carspercapita  cars_per_capita
USA  United States         True            809              809
AUS      Australia        False            731              731
JAP          Japan        False            588              588
IND          India        False             18               18
RUS         Russia         True            200              200
MOR        Morocco         True             70               70
ENG          Egypt         True             45               45

In [22]:
#This is an example of series
country = cars["countries"]
country
type(country)

pandas.core.series.Series

In [23]:
#This is an example of Data Frame
country = cars[["countries", "cars_per_capita"]]
country
type(country)

pandas.core.frame.DataFrame

In [26]:
cars = pd.read_csv("cars.csv", index_col=0)

In [27]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [30]:
cars[["cars_per_cap", "drives_right"]]

     cars_per_cap  drives_right
US            809          True
AUS           731         False
JAP           588         False
IN             18         False
RU            200          True
MOR            70          True
EG             45          True

In [31]:
cars[:4]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False

In [32]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [35]:
cars[2::3]

     cars_per_cap  country  drives_right
JAP           588    Japan         False
MOR            70  Morocco          True

In [37]:
cars.loc[["JAP", "MOR", "RU", "IN"]]

     cars_per_cap  country  drives_right
JAP           588    Japan         False
MOR            70  Morocco          True
RU            200   Russia          True
IN             18    India         False

In [39]:
cars.ix[[3, 2]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     cars_per_cap country  drives_right
IN             18   India         False
JAP           588   Japan         False